backend/app/controllers/gifts_controller.rb

INSERT INTO "gifts" ("name", "description", "price", "link_to_purchase", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @giftItem = Gift.new(
      name: params[:name],
      description: params[:description],
      price: params[:price],
      link_to_purchase: params[:link_to_purchase],
      image: params[:image]
    )

    if !@giftItem.save

SELECT "keywords".* FROM "keywords" WHERE "keywords"."keyword" IN ($1, $2, $3, $4, $5, $6) LIMIT $7  [["keyword", "20 - 50"], ["keyword", "50 - 100"], ["keyword", "20 - 30"], ["keyword", "female"], ["keyword", "likes to try new things"], ["keyword", "practical"], ["LIMIT", 1]]
SELECT "keywords".* FROM "keywords" WHERE "keywords"."keyword" = $1 LIMIT $2  [["keyword", "20 - 50"], ["LIMIT", 1]]
SELECT "gift_to_keywords".* FROM "gift_to_keywords" WHERE "gift_to_keywords"."keyword_id" = $1  [["keyword_id", 15]]
SELECT "keywords".* FROM "keywords" WHERE "keywords"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def show
    #get the ids from the string keywords
    @keyWordArray = params[:keywords]
    @keyWordIDs = Array.new()
    @keyWordArray.each { |key|
      @key = Keyword.find_by(keyword: key)
      @keyWordIDs.push(@key.id)
  }

    @giftIDsArray = Array.new()

    #get all the matching gifts that have those keywords
    #adding duplicates to the array is fine!
    @keyWordIDs.each { |keyID|
      @giftIDs = GiftToKeyword.where(keyword_id: keyID).collect(&:gift_id)
      puts("PUT HERE")
      puts(@giftIDs)
      @giftIDs.each { |id|

SELECT "gifts".* FROM "gifts" WHERE "gifts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    @top6Gifts = Array.new()
    if @topGiftIDs.length >= 9
      for i in 0..8 do
        @topGift = Gift.find(@topGiftIDs[i])