backend/app/controllers/gifts_to_keywords_controller.rb

INSERT INTO "gift_to_keywords" ("gift_id", "keyword_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["gift_id", 2], ["keyword_id", 1], ["created_at", "2021-08-07 17:23:28.578979"], ["updated_at", "2021-08-07 17:23:28.578979"]]
---
  def create
    @connectorItem = GiftToKeyword.new(
      keyword_id: params[:keyword_id],
      gift_id: params[:gift_id]
    )

    if !@connectorItem.save