backend/app/controllers/keywords_controller.rb

INSERT INTO "keywords" ("keyword", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["keyword", "practical"], ["created_at", "2021-08-07 17:04:27.974100"], ["updated_at", "2021-08-07 17:04:27.974100"]]
---
  def create
    @keywordItem = Keyword.new(
      keyword: params[:keyword],
    )

    if !@keywordItem.save