backend/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "isab"], ["password", "password"], ["created_at", "2021-08-08 09:58:23.944544"], ["updated_at", "2021-08-08 09:58:23.944544"]]
---
  def create
    @newUser = User.new(
      username: params[:username],
      password: params[:password]
    )

    if !@newUser.save

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "isab"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(username: params[:username])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def data
    @user = User.find(params[:id])