backend/app/controllers/wishlist_controller.rb

INSERT INTO "wishlists" ("wishlist_id", "user_input", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["wishlist_id", 6], ["user_input", "testing testing"], ["created_at", "2021-08-08 07:35:41.809801"], ["updated_at", "2021-08-08 07:35:41.809801"]]
---
  def create
    @wishlistItem = Wishlist.new(
      wishlist_id: params[:wishlist_id],
      user_input: params[:user_input]
    )

    if !@wishlistItem.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "wishlists".* FROM "wishlists" WHERE "wishlists"."wishlist_id" = $1  [["wishlist_id", 6]]
---
  def show
    @userID = params[:user_id]

    @wishlistID = User.find(@userID)

    @userWishlist = Wishlist.where(wishlist_id: @wishlistID).map(&:user_input)

SELECT "wishlists".* FROM "wishlists" WHERE "wishlists"."wishlist_id" = $1 AND "wishlists"."user_input" = $2  [["wishlist_id", 7], ["user_input", "movie"]]
DELETE FROM "wishlists" WHERE "wishlists"."id" = $1  [["id", 6]]
---
  def destroy
    @wishlist_item_id = Wishlist.where(wishlist_id: params[:wishlist_id], user_input: params[:user_input]).collect(&:id)

    Wishlist.destroy(@wishlist_item_id)